## Parte 7 - Sorting Data

Importando Pandas

In [1]:
import pandas as pd

El DataFrame de trabajo será:

In [2]:
diccionario = {"nombres": ["Manuel", "Tomás", "Sebastián"],
               "apellidos": ["Klug", "Smith", "Jackson"],
              "edad": [23, 23, 22],
              "mails": ["mk@g.com", "tm@g.com", "st@g.com"]}

df_dicc = pd.DataFrame(diccionario)

df_dicc

     nombres apellidos  edad     mails
0     Manuel      Klug    23  mk@g.com
1      Tomás     Smith    23  tm@g.com
2  Sebastián   Jackson    22  st@g.com

### Ordenar alfabéticamente los valores de una columna (de forma ascendente)

In [5]:
df_dicc.sort_values(by="edad")

     nombres apellidos  edad     mails
2  Sebastián   Jackson    22  st@g.com
0     Manuel      Klug    23  mk@g.com
1      Tomás     Smith    23  tm@g.com

In [8]:
df_dicc.sort_values(by="nombres", inplace=True)

In [9]:
df_dicc

     nombres apellidos  edad     mails
0     Manuel      Klug    23  mk@g.com
2  Sebastián   Jackson    22  st@g.com
1      Tomás     Smith    23  tm@g.com

### Ordenar alfabéticamente los valores de una columna (de forma descendente)

In [7]:
df_dicc.sort_values(by="edad", ascending=False)

     nombres apellidos  edad     mails
0     Manuel      Klug    23  mk@g.com
1      Tomás     Smith    23  tm@g.com
2  Sebastián   Jackson    22  st@g.com

### Ordenar los valores del index

In [12]:
df_dicc.sort_index(inplace=True)

In [13]:
df_dicc

     nombres apellidos  edad     mails
0     Manuel      Klug    23  mk@g.com
1      Tomás     Smith    23  tm@g.com
2  Sebastián   Jackson    22  st@g.com